app/controllers/home_controller.rb

  def index
    @teams = Team.where('id = ?', current_user.team_id)
    @projects = Project.where('team_id = ?', current_user.team_id)
---
SELECT "teams".* FROM "teams" WHERE (id = NULL)
SELECT "projects".* FROM "projects" WHERE (team_id = NULL)