app/controllers/projects_controller.rb

  def index
    @projects = Project.all.order("created_at DESC")
---
SELECT "projects".* FROM "projects" ORDER BY created_at DESC