app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" ORDER BY created_at DESC
---
  def index
    @teams = Team.all.order("created_at DESC")